# Pandas

Pandas is a library for data analysis and data manipulation.

In [1]:
import pandas

pandas.DataFrame({'A':[1,2,3],'B':[4,5,6]})

   A  B
0  1  4
1  2  5
2  3  6

Whats the difference between numpy and pandas?

numpy provides the numerical methods and mathematical methods, and can do matrix manipulation in a very efficient and fast way. (its like matlab inside python but with a nicer syntax and no vendor-lock-in)

pandas is based on numpy, but is aimed towards data analysis and ease of use. E.g. we now have headers for columns, while in numpy you yourself have to keep track of what is what. (its like the equivalent of excel in python, with the exception that its actually useable at scale)

In short - if you want to perform some complex mathematical operations on matrices, use numpy. - if you are working with measurements or other tabular data

## Working with dataframes

In [2]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Edward', 'Fiona', 'George', 'Hannah', 'Ivan', 'Julia'],
    'Height': [165, 170, 175, 160, 180, 155, 168, 172, 178, 169], 
    'Age': [25, 32, 40, 22, 28, 30, 35, 26, 41, 29],
    'YearsStudying': [2, 5, 4, 1, 4, 4, 7, 3, 6, 2],
    'Sex': ['Female', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female']
}

df = pd.DataFrame(data)
df

      Name  Height  Age  YearsStudying     Sex
0    Alice     165   25              2  Female
1      Bob     170   32              5    Male
2  Charlie     175   40              4    Male
3    Diana     160   22              1  Female
4   Edward     180   28              4    Male
5    Fiona     155   30              4  Female
6   George     168   35              7    Male
7   Hannah     172   26              3  Female
8     Ivan     178   41              6    Male
9    Julia     169   29              2  Female

`describe` create a very basic statistical overview of the dataset:

In [3]:
df.describe()

           Height        Age  YearsStudying
count   10.000000  10.000000      10.000000
mean   169.200000  30.800000       3.800000
std      7.757434   6.268085       1.873796
min    155.000000  22.000000       1.000000
25%    165.750000  26.500000       2.250000
50%    169.500000  29.500000       4.000000
75%    174.250000  34.250000       4.750000
max    180.000000  41.000000       7.000000

## Indexing Rows

The first column of the dataframe is the index. We can access rows in this dataframe the same way we did using indexes in lists. in the case of dataframes using the iloc function. (stands for integer location, so just the integer row number)

In [4]:
df.iloc[0]

Name              Alice
Height              165
Age                  25
YearsStudying         2
Sex              Female
Name: 0, dtype: object

Slicing operateors also work

In [5]:
df.iloc[3:5]

     Name  Height  Age  YearsStudying     Sex
3   Diana     160   22              1  Female
4  Edward     180   28              4    Male

## Indexing columns

We can access single columns similar to dictionaries.

In [6]:
df['Height']

0    165
1    170
2    175
3    160
4    180
5    155
6    168
7    172
8    178
9    169
Name: Height, dtype: int64

We can use lists of column names to get multiple with one operation

In [7]:
df[['Height', 'Age']]

   Height  Age
0     165   25
1     170   32
2     175   40
3     160   22
4     180   28
5     155   30
6     168   35
7     172   26
8     178   41
9     169   29

To extract a specific value given row and column name

In [8]:
df.iloc[3]['Height']

np.int64(160)

In [9]:
df['Height'].iloc[3]

np.int64(160)

## Mathematical operations on columns

Columns can be used to perform mathematical operations in bulk. Very similar to numpy (pandas actually uses numpy behind the curtain to do this).
So we do not need loops, but can apply mathemtical operations directly to a whole bunch of data.

For example, how old were they when they started studying?

In [10]:

df['Age'] - df['YearsStudying']

0    23
1    27
2    36
3    21
4    24
5    26
6    28
7    23
8    35
9    27
dtype: int64

## Adding new columns

Lets add the age when starting their studies back to the dataframe as a new column

In [11]:
df['StartAge'] = df['Age'] - df['YearsStudying']
df

      Name  Height  Age  YearsStudying     Sex  StartAge
0    Alice     165   25              2  Female        23
1      Bob     170   32              5    Male        27
2  Charlie     175   40              4    Male        36
3    Diana     160   22              1  Female        21
4   Edward     180   28              4    Male        24
5    Fiona     155   30              4  Female        26
6   George     168   35              7    Male        28
7   Hannah     172   26              3  Female        23
8     Ivan     178   41              6    Male        35
9    Julia     169   29              2  Female        27

**Exercise**: Calculate what percentage of their lifespan people have been studying (years studying / height) * 100

## Separating data based on conditions and grouping

While slicing per index is useful, in practice we are often interested to look only at a specific part of the data to perform some analysis. For example, compare the height of male and female students.

We can create True/False vectors if some condition is fulfilled or not:

In [12]:
df['Sex'] == 'Male'

0    False
1     True
2     True
3    False
4     True
5    False
6     True
7    False
8     True
9    False
Name: Sex, dtype: bool

While this alone isnt that useful, such a vector of booleans can be use as an indexer. In the following example, we use this to select only the males from the dataframe.

In [13]:
df[df['Sex'] == 'Male']

      Name  Height  Age  YearsStudying   Sex  StartAge
1      Bob     170   32              5  Male        27
2  Charlie     175   40              4  Male        36
4   Edward     180   28              4  Male        24
6   George     168   35              7  Male        28
8     Ivan     178   41              6  Male        35

**Exercise**: Select all rows where the height is above 175

We can also chain such conditions, however, syntax is slightly different than regular python boolean operations

In [14]:
df[(df['Sex'] == 'Male') & (df['Age'] >= 35)]

      Name  Height  Age  YearsStudying   Sex  StartAge
2  Charlie     175   40              4  Male        36
6   George     168   35              7  Male        28
8     Ivan     178   41              6  Male        35

**Exercise**: Select all rows of males with a height greater than 175

## Basic math functions on columns (or rows)

What weve already seen with 'describe' we can perform selectively aswell

In [15]:
print(df['Age'].mean())
print(df['Age'].std())

30.8
6.268084945889685

Also, all kinds of maths functions are available in pandas

In [16]:
print(df['Age'].sum())
print(df['Age'].min())
print(df['Age'].max())

308
22
41

Some functions return not a skalar, but again a series (a column)

In [17]:
print(df['Age'].cumsum())

0     25
1     57
2     97
3    119
4    147
5    177
6    212
7    238
8    279
9    308
Name: Age, dtype: int64

**Exercise**: Calculate the mean and std of age of male and female students separately

## Loading and storing data

While pandas supports a TON of different formats, we will mostly deal with csv for now.

We can store a dataframe as csv file with 'to_csv'

In [18]:
df.to_csv('pandas_students_example.csv')

And load it again, using 'pandas.read_csv'

In [19]:
df = pandas.read_csv('pandas_students_example.csv')